const treeData1 = [{
    "name": "한국과학기술원",
    "children": [
        {
            "name": "울산과학기술원",
            "children": [
                {
                    "name": "포항공과대학교",
                    "children": [
                        {
                            "name": "포항공과대학교"
                        }
                    ]
                },
                {
                    "name": "부경대학교",
                    "children": [
                        {
                            "name": "영남대학교"
                        }
                    ]
                }
            ]
        },
        {
            "name": "한국과학기술원",
            "children": [
                {
                    "name": "성균관대학교",
                    "children": [
                        {
                            "name": "대구경북과학기술원"
                        },
                        {
                            "name": "대구경북과학기술원",
                            "children": [
                                {
                                    "name": "대구경북과학기술원",
                                    "children":[
                                        {
                                            "name": "성균관대학교",
                                            "children": [
                                                {
                                                    "name": "강릉원주대학교"
                                                },
                                                {
                                                    "name": "강릉원주대학교"
                                                },
                                                {
                                                    "name": "부산대학교"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "name": "대구경북과학기술원"
                                },
                                {
                                    "name": "대구경북과학기술원"
                                }
                            ]
                        },
                        {
                            "name": "서강대학교"
                        },
                        {
                            "name": "부산대학교"
                        }
                    ]
                }
            ]
        }
    ]
}

];
const treeData2 = [
    {
      "name": "경희대학교 국제캠퍼스",
      "children": [
          {
              "name": "서울과학기술대학교",
              "children":[
                  {
                      "name": "부천대학교"
                  }
              ]
          },
          {
              "name": "아주대학교",
              "children":[
                  {
                      "name": "인하대학교",
                      "children":[
                          {
                              "name": "경북대학교"
                          }
                      ]
                  }
              ]
          }
      ]
    }
];

const treeData3 = [
    {
        "name": "한국교통대학교",
        "children":[
            {
                "name": "고려대학교",
                "children": [
                    {
                        "name": "홍익대학교",
                        "children":[
                            {
                                "name": "덕성여자대학교"
                            }
                        ]
                    },
                    {
                        "name": "청강문화산업대학교"
                    }
                ]
            },
            {
                "name": "숙명여자대학교",
                "children":[
                    {
                        "name": "백석예술대학교",
                        "children": [
                            {
                                "name": "상지대학교"
                            },
                            {
                                "name": "상지대학교"
                            }
                        ]
                    },
                    {
                        "name": "강원대학교"
                    }
                ]
            }
        ]
    }
];

const treeData4 = [
    {
        "name": "한국과학기술원",
        "children": [
            {
                "name": "가톨릭대학교",
                "children": [
                    {
                        "name": "서울대학교",
                        "children": [
                            {
                                "name": "성신여자대학교"
                            }
                        ]
                    },
                    {
                        "name": "서울대학교"
                    },
                    {
                        "name": "연세대학교",
                        "children":[
                            {
                                "name": "고려대학교",
                                "children":[
                                    {
                                        "name": "한국과학기술원",
                                        "children":[
                                            {
                                                "name": "한국과학기술원"
                                            },
                                            {
                                                "name": "울산과학기술원"
                                            }
                                        ]
                                    },
                                    {
                                        "name": "기타"
                                    }
                                ]
                            },
                            {
                                "name": "전주대학교",
                                "children": [
                                    {
                                        "name": "중앙대학교"
                                    },
                                    {
                                        "name": "중앙대학교",
                                        "children":[
                                            {
                                                "name": "고려대학교"
                                            },
                                            {
                                                "name": "고려대학교",
                                                "children":[
                                                    {
                                                        "name": "연세대학교"
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "name": "연세대학교"
                    }
                ]
            }
        ]
    }
];

const treeData5 = [
    {
        "name": "동국대학교(경주)",
        "children": [
            {
                "name": "한국과학기술원",
                "children":[
                    {
                        "name": "연세대학교",
                        "children": [
                            {
                                "name": "한국과학기술원",
                                "children": [
                                    {
                                        "name": "한국과학기술원",
                                        "children": [
                                            {
                                                "name": "인하대학교",
                                                "children": [
                                                    {
                                                        "name": "단국대학교",
                                                        "children":[
                                                            {
                                                                "name": "기타",
                                                                "children": [
                                                                    {
                                                                        "name": "중원대학교",
                                                                        "children": [
                                                                            {
                                                                                "name": "공주대학교"
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    },
                                                    {
                                                        "name": "한양대학교",
                                                        "children":[
                                                            {
                                                                "name": "아주대학교"
                                                            },
                                                            {
                                                                "name": "성균관대학교"
                                                            },
                                                            {
                                                                "name": "성균관대학교"
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "name": "서울대학교"
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "name": "연세대학교"
                            }
                        ]
                    },
                    {
                        "name": "한국과학기술원"
                    }
                ]
            },
            {
                "name": "서울대학교"
            }
        ]
    }
];

const treeData6 = [
    {
        "name": "한양대학교(ERICA)",
        "children": [
            {
                "name": "아주대학교",
                "children": [
                    {
                        "name": "한양대학교",
                        "children": [
                            {
                                "name": "한양대학교"
                            }
                        ]
                    },
                    {
                        "name": "인하대학교",
                        "children": [
                            {
                                "name": "성균관대학교",
                                "children": [
                                    {
                                        "name": "서울대학교",
                                        "children": [
                                            {
                                                "name": "연세대학교",
                                                "children": [
                                                    {
                                                        "name": "경희대학교",
                                                        "children": [
                                                            {
                                                                "name": "경희대학교"
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "name": "아주대학교"
                            }
                        ]
                    }
                ]
            }
        ]
    }

];

const treeData7 = [
    {
        "name": "대구경북과학기술원",
        "children": [
            {
                "name": "대구경북과학기술원",
                "children": [
                    {
                        "name": "대림대학교",
                        "children":[
                            {
                                "name": "전주대학교"
                            },
                            {
                                "name": "우석대학교"
                            }
                        ]
                    },
                    {
                        "name": "군산대학교"
                    }
                ]
            },
            {
                "name": "경희대학교",
                "children": [
                    {
                        "name": "건국대학교(글로컬)"
                    }
                ]
            }
        ]
    }
];

const treeDataList = [treeData1, treeData2, treeData3, treeData4, treeData5, treeData6, treeData7];

const pos = [
    {"name": "경희대학교 국제캠퍼스",
    "lat": 37.2429688,
    "lng": 127.080053
    },
    {"name": "서울과학기술대학교",
    "lat": 37.6316684,
    "lng": 127.0774813
    },
    {"name": "부천대학교",
    "lat": 37.4893955,
    "lng": 126.7789007
    },
    {"name": "아주대학교",
    "lat": 37.2833633,
    "lng": 127.0465105
    },
    {"name": "인하대학교",
    "lat": 37.4500221,
    "lng": 126.653488
    },
    {"name": "경북대학교",
    "lat": 35.8888003,
    "lng": 128.6102815
    },
    {"name": "한국과학기술원",
    "lat": 36.3707172,
    "lng": 127.3573506
    },
    {"name": "울산과학기술원",
    "lat": 35.5763317,
    "lng": 129.189255
    },
    {"name": "포항공과대학교",
    "lat": 36.0164741,
    "lng": 129.3234608
    },
    {"name": "부경대학교",
    "lat": 35.1347632,
    "lng": 129.1081092
    },
    {"name": "성균관대학교",
    "lat": 37.5871833,
    "lng": 126.9930833
    },
    {"name": "영남대학교",
    "lat": 35.8367325,
    "lng": 128.754368
    },
    {"name": "대구경북과학기술원",
    "lat": 35.6921852,
    "lng": 128.4504959
    },
    {"name": "서강대학교",
    "lat": 37.5513353,
    "lng": 126.9407371
    },
    {"name": "부산대학교",
    "lat": 35.2339681,
    "lng": 129.0806855
    },
    {"name": "강릉원주대학교",
    "lat": 37.7664551,
    "lng": 128.8712017
    },
    {"name": "한국교통대학교",
    "lat": 36.9687657,
    "lng": 127.8717471
    },
    {"name": "고려대학교",
    "lat": 37.5900117,
    "lng": 127.0318586
    },
    {"name": "숙명여자대학교",
    "lat": 37.5463644,
    "lng": 126.9648311
    },
    {"name": "홍익대학교",
    "lat": 37.5509768999999,
    "lng": 126.9257006
    },
    {"name": "청강문화산업대학교",
    "lat": 37.2049315,
    "lng": 127.3545245
    },
    {"name": "백석예술대학교",
    "lat": 37.480308,
    "lng": 126.9967862
    },
    {"name": "강원대학교",
    "lat": 37.8694561,
    "lng": 127.7444707
    },
    {"name": "덕성여자대학교",
    "lat": 37.6511988,
    "lng": 127.0161604
    },
    {"name": "상지대학교",
    "lat": 37.3706973,
    "lng": 127.9280728
    },
    {"name": "가톨릭대학교",
    "lat": 37.4857571999999,
    "lng": 126.8043614
    },
    {"name": "서울대학교",
    "lat": 37.480912,
    "lng": 126.953218
    },
    {"name": "연세대학교",
    "lat": 37.564089,
    "lng": 126.9389809
    },
    {"name": "성신여자대학교",
    "lat": 37.5927408,
    "lng": 127.0224394
    },
    {"name": "전주대학교",
    "lat": 35.8135772,
    "lng": 127.0874667
    },
    {"name": "중앙대학교",
    "lat": 37.5049996,
    "lng": 126.957378
    },
    {"name": "동국대학교(경주)",
    "lat": 35.8635396,
    "lng": 129.1933991
    },
    {"name": "단국대학교",
    "lat": 37.3229512,
    "lng": 127.1279079
    },
    {"name": "한양대학교",
    "lat": 37.5566065999999,
    "lng": 127.0484194
    },
    {"name": "중원대학교",
    "lat": 36.8175843,
    "lng": 127.8003413
    },
    {"name": "공주대학교",
    "lat": 36.4691463,
    "lng": 127.1409327
    },
    {"name": "한양대학교(ERICA)",
    "lat": 37.2974415,
    "lng": 126.8355968
    },
    {"name": "경희대학교",
    "lat": 37.5953632,
    "lng": 127.0527612
    },
    {"name": "대림대학교",
    "lat": 37.4035503,
    "lng": 126.930539
    },
    {"name": "군산대학교",
    "lat": 35.9460546,
    "lng": 126.6821658
    },
    {"name": "건국대학교(글로컬)",
    "lat": 36.9492896,
    "lng": 127.9073904
    },
    {"name": "우석대학교",
    "lat": 35.9125859,
    "lng": 127.0665291
    }
];